## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # kubectl_manifest.argocd_application will be created
  + resource "kubectl_manifest" "argocd_application" {
      + api_version             = "argoproj.io/v1alpha1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Application"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "gym-management"
      + namespace               = "argocd"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: argoproj.io/v1alpha1
            kind: Application
            metadata:
              finalizers:
              - resources-finalizer.argocd.argoproj.io
              name: gym-management
              namespace: argocd
            spec:
              destination:
                namespace: gymmanagement
                server: https://kubernetes.default.svc
              project: prod-project
              source:
                helm:
                  valueFiles:
                  - ../../values/gymmanagement-dev.yaml
                  - ../../values/gymmanagement-dev-image.yaml
                  valuesObject:
                    configmap:
                      db_host: prod-mysql-master.crk08w2s2loh.us-west-2.rds.amazonaws.com
                      db_name: Gym
                      db_user: root
                    ingress:
                      enabled: true
                      httpAuth:
                        password: rdaYApW7rqYabRrX
                        user: vitali
                      tls:
                      - hosts:
                        - project.local
                        secretName: ingress-project-tls
                    secret:
                      db_password: VVsCU7HFQAtdf1Yk
                path: charts/gymmanagement
                repoURL: https://github.com/klimantovich/us-west-1-cluster
                targetRevision: HEAD
              syncPolicy:
                automated: {}
                syncOptions:
                - CreateNamespace=true
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.argocd_project will be created
  + resource "kubectl_manifest" "argocd_project" {
      + api_version             = "argoproj.io/v1alpha1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "AppProject"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "prod-project"
      + namespace               = "argocd"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: argoproj.io/v1alpha1
            kind: AppProject
            metadata:
              finalizers:
              - resources-finalizer.argocd.argoproj.io
              name: prod-project
              namespace: argocd
            spec:
              clusterResourceWhitelist:
              - group: '*'
                kind: Namespace
              destinations:
              - name: in-cluster
                namespace: gymmanagement
                server: https://kubernetes.default.svc
              namespaceResourceWhitelist:
              - group: apps
                kind: Deployment
              - group: '*'
                kind: ConfigMap
              - group: '*'
                kind: Secret
              - group: networking.k8s.io
                kind: Ingress
              - group: '*'
                kind: Service
              sourceRepos:
              - https://github.com/klimantovich/us-west-1-cluster
        EOT
      + yaml_incluster          = (sensitive value)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>